<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core"%>
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>获取天气</title>
<script type="text/javascript"
	src="<c:url value='/jquery-1.9.1.min.js'/>"></script>
<script type="text/javascript">
	var weather = {
		"Code" : "200",
		"Message" : null,
		"Data" : "{\"aqi\":{\"city\":{\"aqi\":\"41\",\"co\":\"1\",\"no2\":\"23\",\"o3\":\"128\",\"pm10\":\"35\",\"pm25\":\"20\",\"qlty\":\"优\",\"so2\":\"13\"}},\"basic\":{\"city\":\"宁波\",\"cnty\":\"中国\",\"id\":\"CN101210401\",\"lat\":\"29.872000\",\"lon\":\"121.542000\",\"update\":{\"loc\":\"2015-09-21 14:50\",\"utc\":\"2015-09-21 06:50\"}},\"daily_forecast\":[{\"astro\":{\"sr\":\"05:41\",\"ss\":\"17:52\"},\"cond\":{\"code_d\":\"101\",\"code_n\":\"101\",\"txt_d\":\"多云\",\"txt_n\":\"多云\"},\"date\":\"2015-09-21\",\"hum\":\"64\",\"pcpn\":\"0.1\",\"pop\":\"1\",\"pres\":\"1013\",\"tmp\":{\"max\":\"28\",\"min\":\"20\"},\"vis\":\"10\",\"wind\":{\"deg\":\"79\",\"dir\":\"东风\",\"sc\":\"微风\",\"spd\":\"11\"}},{\"astro\":{\"sr\":\"05:41\",\"ss\":\"17:51\"},\"cond\":{\"code_d\":\"300\",\"code_n\":\"300\",\"txt_d\":\"阵雨\",\"txt_n\":\"阵雨\"},\"date\":\"2015-09-22\",\"hum\":\"74\",\"pcpn\":\"3.0\",\"pop\":\"88\",\"pres\":\"1012\",\"tmp\":{\"max\":\"27\",\"min\":\"20\"},\"vis\":\"10\",\"wind\":{\"deg\":\"139\",\"dir\":\"东南风\",\"sc\":\"3-4\",\"spd\":\"11\"}},{\"astro\":{\"sr\":\"05:42\",\"ss\":\"17:50\"},\"cond\":{\"code_d\":\"104\",\"code_n\":\"101\",\"txt_d\":\"阴\",\"txt_n\":\"多云\"},\"date\":\"2015-09-23\",\"hum\":\"66\",\"pcpn\":\"1.2\",\"pop\":\"80\",\"pres\":\"1008\",\"tmp\":{\"max\":\"28\",\"min\":\"21\"},\"vis\":\"10\",\"wind\":{\"deg\":\"347\",\"dir\":\"东南风\",\"sc\":\"3-4\",\"spd\":\"11\"}},{\"astro\":{\"sr\":\"05:42\",\"ss\":\"17:49\"},\"cond\":{\"code_d\":\"101\",\"code_n\":\"101\",\"txt_d\":\"多云\",\"txt_n\":\"多云\"},\"date\":\"2015-09-24\",\"hum\":\"68\",\"pcpn\":\"0.4\",\"pop\":\"72\",\"pres\":\"1007\",\"tmp\":{\"max\":\"29\",\"min\":\"22\"},\"vis\":\"10\",\"wind\":{\"deg\":\"32\",\"dir\":\"东南风\",\"sc\":\"微风\",\"spd\":\"11\"}},{\"astro\":{\"sr\":\"05:43\",\"ss\":\"17:47\"},\"cond\":{\"code_d\":\"302\",\"code_n\":\"300\",\"txt_d\":\"雷阵雨\",\"txt_n\":\"阵雨\"},\"date\":\"2015-09-25\",\"hum\":\"69\",\"pcpn\":\"0.2\",\"pop\":\"63\",\"pres\":\"1005\",\"tmp\":{\"max\":\"28\",\"min\":\"20\"},\"vis\":\"10\",\"wind\":{\"deg\":\"36\",\"dir\":\"东南风\",\"sc\":\"3-4\",\"spd\":\"11\"}},{\"astro\":{\"sr\":\"05:44\",\"ss\":\"17:46\"},\"cond\":{\"code_d\":\"101\",\"code_n\":\"101\",\"txt_d\":\"多云\",\"txt_n\":\"多云\"},\"date\":\"2015-09-26\",\"hum\":\"66\",\"pcpn\":\"0.5\",\"pop\":\"55\",\"pres\":\"1008\",\"tmp\":{\"max\":\"25\",\"min\":\"19\"},\"vis\":\"10\",\"wind\":{\"deg\":\"24\",\"dir\":\"北风\",\"sc\":\"3-4\",\"spd\":\"11\"}},{\"astro\":{\"sr\":\"05:44\",\"ss\":\"17:45\"},\"cond\":{\"code_d\":\"101\",\"code_n\":\"101\",\"txt_d\":\"多云\",\"txt_n\":\"多云\"},\"date\":\"2015-09-27\",\"hum\":\"63\",\"pcpn\":\"0.1\",\"pop\":\"13\",\"pres\":\"1010\",\"tmp\":{\"max\":\"26\",\"min\":\"19\"},\"vis\":\"10\",\"wind\":{\"deg\":\"25\",\"dir\":\"北风\",\"sc\":\"3-4\",\"spd\":\"11\"}}],\"hourly_forecast\":[{\"date\":\"2015-09-21 16:00\",\"hum\":\"70\",\"pop\":\"1\",\"pres\":\"1013\",\"tmp\":\"26\",\"wind\":{\"deg\":\"89\",\"dir\":\"东风\",\"sc\":\"3-4\",\"spd\":\"17\"}},{\"date\":\"2015-09-21 19:00\",\"hum\":\"79\",\"pop\":\"0\",\"pres\":\"1013\",\"tmp\":\"23\",\"wind\":{\"deg\":\"111\",\"dir\":\"东南风\",\"sc\":\"微风\",\"spd\":\"13\"}},{\"date\":\"2015-09-21 22:00\",\"hum\":\"82\",\"pop\":\"0\",\"pres\":\"1014\",\"tmp\":\"21\",\"wind\":{\"deg\":\"126\",\"dir\":\"东南风\",\"sc\":\"微风\",\"spd\":\"9\"}}],\"now\":{\"cond\":{\"code\":\"101\",\"txt\":\"多云\"},\"fl\":\"26\",\"hum\":\"85\",\"pcpn\":\".3\",\"pres\":\"1012\",\"tmp\":\"23\",\"vis\":\"10\",\"wind\":{\"deg\":\"79\",\"dir\":\"东风\",\"sc\":\"3-4\",\"spd\":\"0\"}},\"status\":\"ok\",\"suggestion\":{\"comf\":{\"brf\":\"较舒适\",\"txt\":\"白天天气晴好，您在这种天气条件下，会感觉早晚凉爽、舒适，午后偏热。\"},\"cw\":{\"brf\":\"较适宜\",\"txt\":\"较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。\"},\"drsg\":{\"brf\":\"热\",\"txt\":\"天气热，建议着短裙、短裤、短薄外套、T恤等夏季服装。\"},\"flu\":{\"brf\":\"少发\",\"txt\":\"各项气象条件适宜，无明显降温过程，发生感冒机率较低。\"},\"sport\":{\"brf\":\"适宜\",\"txt\":\"天气较好，赶快投身大自然参与户外运动，尽情感受运动的快乐吧。\"},\"trav\":{\"brf\":\"适宜\",\"txt\":\"天气较好，但丝毫不会影响您出行的心情。温度适宜又有微风相伴，适宜旅游。\"},\"uv\":{\"brf\":\"弱\",\"txt\":\"紫外线强度较弱，建议出门前涂擦SPF在12-15之间、PA+的防晒护肤品。\"}}}",
		"SubCode" : null
	};

	$(document)
			.ready(
					function() {
						$
								.ajax({
									url : "http://120.24.159.207:8081/CMS/News/GetWeather?cityname=宁波",
									type : "POST",
									dataType : "json",
									asyn : false,
									cache : false,
									success : function(result) {
										alert(result.Code);
										//alert(result.Data.aqi.city.pm10);
									}
								});
					});
</script>

</head>
<body>
	获取天气页面
	<br>
	<br>


</body>
</html>